Meshes & Solutions/blockgen-8/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       2280;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       2320;
    }
    polygon
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       2360;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          1200;
        startFace       2440;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          1200;
        startFace       3640;
    }
    outside
    {
        type            patch;
        nFaces          80;
        startFace       4840;
    }
)

// ************************************************************************* //
